# Форматирование строк - это подстановка в них значений

name = 'Вера'  # Создание переменной
print('Привет', name)  # Вывод на экран двух объетов: строки-константы 
                       # (литерала) и переменной строкового типа
chto = 'Привет', name  # tuple - кортеж, похож на константный массив в js
print('chto = ', chto)

# Функция print принимает неограниченное количество параметров через запятую
# После каждого напечатанного значения параметра она ставит пробел
# В конце она ставит перенос строки

print('1'+'2'+'3')  # Конкатенация, склеивание строк

# Форматирование конкатенацией - один из способов форматирования строк
# Конкатенировать в питоне можно только строки

name = 'Вера'
print('Привет' + name)  # Вычисление выражения происходит до печати
chto = 'Привет' + name
print('chto = ', chto)

# Чтобы конкатенировать строку с любым другим объектом,
# сперва надо его привести (т.е. превратить) в строку