# Задание №1 (Список еды)
# Создать список еды, самой любимой, не меньше 5 блюд.
# Вывести на экран:
# Моя любимая еда:
# Картошка
# Гречка
# ...
# Хлеб

favorite_food = ["Пицца", "Суши", "Шашлык", "Тирамису", "Борщ"]
print("Моя любимая еда:")
for food in favorite_food:
    print(food)
