# Задание №3 (понедельник, 22 сентября)
# Пусть есть список строк
# Создать список их длин в обратном порядке
# Например ['роза', 'мимоза'] будет [6, 4]
# Разумеется, перебором, а не вручную написать два списка и все


fruits = ['яблоко', 'банан', 'апельсин', 'киви', 'манго']
lengths_reversed = [len(s) for s in fruits][::-1]
print(lengths_reversed)
