# Задание 1
# Напишите функцию, которая отображает на экран форматированный текст, указанный ниже:
# “Don't compare yourself with anyone in this world…
# if you do so, you are insulting yourself."

def print_formatted_quote():
    quote = """
    “Don't compare yourself with anyone in this world…
    if you do so, you are insulting yourself.”
    """
    print(quote)
print_formatted_quote()
