# Напишите функцию, которая возвращает минимальное из пяти чисел. Числа передаются в качестве параметров.

def find_min(a, b, c, d, e):
    return min(a, b, c, d, e)

min_value = find_min(5, 2, 8, 1, 9)
print(f"Минимальное число: {min_value}")
