# Напишите функцию, которая считает количество цифр в числе. Число передаётся в качестве параметра. Из функции нужно вернуть полученное количество цифр. Например, если передали 3456, количество цифр будет 4.

def count_digits(number):
    return len(str(abs(number)))

num = 3456
digit_count = count_digits(num)
print(f"Количество цифр в числе {num}: {digit_count}")
