# Задачи:
# 1. Есть список фруктов. Вывести его на печать
# 2. Есть список валют. Вывести на печать только длины их названий
# 3. Есть список чисел от 5 до 15 подряд. Создать новый список из их кубов (6*6*6 - куб шести)

# 1. Есть список фруктов. Вывести его на печать
fruits = ['яблоко', 'банан', 'апельсин', 'киви', 'манго']
for elem in fruits:
    print(elem)


# 2. Есть список валют. Вывести на печать только длины их названий
stroki = ['доллар', 'евро', 'рубль', 'иена', 'фунт']
for stroka in stroki:
    dlina = len(stroka)
    print(stroka, dlina)


currencies = ['доллар', 'евро', 'рубль', 'иена', 'фунт']
lengths = [len(currency) for currency in currencies]
print(lengths)


# 3. Есть список чисел от 5 до 15 подряд. Создать новый список из их кубов (6*6*6 - куб шести)
numbers = list(range(5, 16))
cubes = []
for x in numbers:
    cubes.append(x * x * x)
print(cubes)


# Создаем список чисел от 5 до 15
numbers = list(range(5, 16))

# Создаем новый список из кубов этих чисел
cubes = [num ** 3 for num in numbers]

# Выводим результат
print(cubes)

