# Создать список lst всех чисел от 1 до 100. 
# 1. Из него (lst) создать список всех двузначных чисел, начинающихся на 5
# 2. Из него (lst) создать новый список - числа, которые содержат в составе 7
# напоминание in - оператор проверки вхождения  'bc' in 'abc' True
# 3. Из него (lst) создать список строк, содержащих каждый десяток отдельно
# 123456789, 10111213141516171819, 20212223.....  и т.д.

# Создать список lst всех чисел от 1 до 100.
lst = list(range(1, 101))

# 1. 
two_digit_starting_with_5 = [num for num in lst if 50 <= num < 60]
print("Двузначные числа, начинающиеся на 5:", two_digit_starting_with_5)


# 2. 
numbers_with_7 = [num for num in lst if '7' in str(num)]
print("числа, содержащие 7:", numbers_with_7)


# 3. 
decades = [''.join(map(str, range(i, i + 10))) for i in range(1, 101, 10)]
print("Строки с каждым десятком:", decades)
