# 3. Спросить человека размеры поля (х * у), 
# получить их ОДНИМ вводом '7x8', 
# Нарисовать только границу поля и пустую серединку.

sizes = input('Введите размеры поля (WхH): ')
W, H = sizes.split('x')
W = int(W)  # width = ширина
H = int(H)  # height = высота
print('o' * W)  # Верх отдельно
# первая и последняя ошечки и серединка на 2 пробела меньше
# общей ширины поля
print(('o' + ' ' * (W - 2)  + 'o\n') * (H - 2), end='')
print('o' * W)  # Низ отдельно

print()

# 2. Спросить человека размеры поля (х * у), 
# получить их ОДНИМ вводом '7x8', 
# "нарисовать" поле буковками о без использования цикла.

sizes = input('Введите размеры поля (WхH): ')
W, H = sizes.split('x')
W = int(W)  # width = ширина
H = int(H)  # height = высота
h = 0
while h < H:
    # Цикл по строкам
    h += 1
    w = 0
    while w < W:
        w += 1
        print('o', end='')
    print()
#print(('o' * W + '\n') * H)

