# БЫКИ И КОРОВЫ
# Необходимо загадать число из 4 различных цифр
# Необходимо сообщить пользователю краткие правила игры
# И предоставить возможность сделать первый ход
# Проверить ответ, выдав диагностику: сколько цифр расположено на своих местах, а сколько - на чужих
# Если число не угадано, предоставить возможность сделать новое предположение


# Необходимо загадать число из 4 различных цифр
# 2356
import random
#random.choice('')
# САМОСТОЯТЕЛЬНО ПОСМОТРЕТЬ ДРУГИЕ ФУНКЦИИ!!
#array = [
#    random.randint(0, 9)),
#    random.randint(0, 9)),
#    random.randint(0, 9)),
#    random.randint(0, 9))
#]
#0, 1, 2, 3, 4, 5, 6, 7, 8, 9

'''
У нас есть кубики - список из 10 чисел от 0 до 9                  kubiki = [i for i in range(0, 10)]
Создаем пустой список для загадки                                 zagadka = []

ПОВТОРИТЬ 4 РАЗА
Берем случайный кубик, т.е. выбираем число от 0 до длины списка   pos = random.randint(0, len(kubiki)-1)
Это будет номер позиции в нашем списке
Смотрим, какой кубик там лежит                                    cifra = kubiki[pos]
Удаляем кубик из набора                                           del kubiki[pos]
Кладем цифру в загадку                                            zagadka.append(cifra)
'''

kubiki = [str(i) for i in range(0, 10)]
zagadka = []
for i in range(4):       # 1True 
    pos = random.randint(i == 0, len(kubiki) - 1)
    cifra = kubiki[pos]
    del kubiki[pos]
    zagadka.append(cifra)
#print(zagadka)

# Необходимо сообщить пользователю краткие правила игры
print('''ПРИВЕТ! Я загадал 4-х значное число, цифры не повторяются,
ты можешь называть только число целиком. Я посмотрю на него и проверю,
есть ли среди твоих цифр - мои. Если цифра есть и стоит на своем месте,
она называется Бык, если на чужом - корова. Я посчитаю и сообщу тебе
общее количество быков и коров, не указывая конкретные позиции.
''')

popitka = -1
# ПОКА число не угадано
while popitka != zagadka:
    # И предоставить возможность сделать новый ход
    popitka = list(input('Введи свое 4хзначное число: '))   # '5432' -> ['5', '4', '3', '2']
    # Проверить ответ, выдав диагностику: сколько цифр расположено на своих местах, а сколько - на чужих
    ['5', '7', '2', '9']  # popitka
    ['5', '4', '3', '2']  # zagadka
    # Ведущий проверяет каждую цифру. Если на своем месте - бык,
    # на чужом - корова. Потом подсчитывает животных и выдает результат.


print('Ура, ты выиграл!')


# 
#
#
#
