/**  Чтобы создать функцию:
 * 1. Ключевое слово function
 * 2. Название (с теми же ограничениями, что и название переменной: буквы, цифры, подчеркивания, начинается с буквы!)
 * 3. Круглые скобки, в которых можно через запятую перечислить названия будущих аргументов == "формальных параметров"
 * 4. Блок кода, он же тело функции, в нем можно использовать формальные параметры, НЕ ЗНАЯ ЗАРАНЕЕ, чему они равны
 * 5. Оператор возврата - ключевое слово return за которым следует возвращаемое значение
 * 6. Функция имеет право вызывать в своем теле другие функции. В том числе - себя (рекурсия). Если две и более функций вызывают друг друга - это кольцевая рекурсия
 * Существует теорема, согласно которой любую рекурсивную функцию можно переписать без рекурсии циклами. Стек придется реализовывать самому
 
*/