# Программа "забывчивая бабушка"
name = ''
while name != 'отстань':  # True:
    name = input('Прости сынок, я забыла, как тебя зовут?')
    # if name == 'отстань':  # Если имя равно отстань, то выйти
    #    break              
    # Иначе - не выходить. Продолжать.
    # Что такое "иначе" для выражения "имя равно отстань?"\
    # Как записать отрицание фразы "имя равно отстань?" "имя НЕ равно отстань"
    # Т.е. ПРОДОЛЖАТЬ, ПОКА имя не равно отстань
print('Сынок, не груби бабушке, будет тебе сто лет, тоже своё имя не вспомнишь!')
