# Написать свой класс для хранения информации о человеке: фамилия, имя, отчество, дата рождения

from datetime import date

class Person:
    def __init__(self, surname, name, patronymic, birth_date):
        self.surname = surname
        self.name = name
        self.patronymic = patronymic
        self.birth_date = birth_date  


# Напишите свой метод :  
# Делает задачу завершённой
# Проверяет, завершена ли задача?
# Устанавливает новое описание.
# Устанавливает новый дедлайн
# Проверяет, сколько осталось дней до срока выполнения? Часов?
# Сколько дней было дано на задачу?
# попадали ли в дни выполнения сб, вс, праздники? Сколько дней было на задачу с учётом праздников и выходных?




    



    
    

    

   

    
