# 7. Создать кортеж из строк. Проверить возможность редактирования строки в кортеже

words_list = ['привет', 'мир', 'python']
words_list[0] = 'пока'  
print(words_list)  
