// У меня было 2000 рублей. 
// Сегодня я купил обувь за 700 руб. и 
// 10 конфет по 83 руб. 
// На всё это я потратил не знаю, сколько руб.
// Сейчас у меня в кошельке осталось тоже не знаю, сколько руб.// 
// Сколько буханок я могу купить из оставшейся суммы, если буханка стоит 100 рублей?//

/** Замечание №1: не надо изменять условие задачи без необходимости
 *  Замечание №2: переменным надо давать имена в соответствии с их назначением:
 *  стоимость, например, cena, tsena, price, ...
 *  количество денег, напрмер, money, dengi i t.d.
 *  Замечание №3: по возможности объявлять константы, а не переменные.
 */

const money_was = 2000;
const shoes = 700;
const choco = 83;
const skolko = 10;  // amount, count, quantity, howmanycandy...
let remain = (money_was - shoes - (choco * skolko));
let buhanka = 100;  
console.log(Math.floor(remain / buhanka));
//Ответ: 4 буханки//

