# Создать класс "Легковая машина", у которой количество колес 4. 
# Свойства: количество колес. Показать, что работают все унаследованные и новые методы.

class Car:
    """
    Базовый класс, представляющий машину.
    """
    def __init__(self, brand, color, speed=0):
        """
        Конструктор класса Car.

        Args:
            brand (str): Марка машины.
            color (str): Цвет машины.
            speed (int):  Скорость машины.
        """
        self.brand = brand  # Марка машины
        self.color = color  # Цвет машины
        self.speed = speed  # Скорость машины

    def drive(self, speed):
        """
        Устанавливает скорость машины.

        Args:
            speed (int): Новая скорость машины.
        """
        self.speed = speed

    def stop(self):
        """
        Останавливает машину (обнуляет скорость).
        """
        self.speed = 0

class PassengerCar(Car):
    """
    Класс, представляющий легковую машину, наследуется от класса Car.
    """
    def __init__(self, brand, color):
        """
        Конструктор класса PassengerCar. Устанавливает количество колес равным 4.

        Args:
            brand (str): Марка машины.
            color (str): Цвет машины.
        """
        super().__init__(brand, color)  # Вызываем конструктор базового класса
        self.num_wheels = 4  # Устанавливаем количество колес

    def display_info(self):
        """
        Выводит информацию о легковой машине.
        """
        print(f"Марка: {self.brand}, Цвет: {self.color}, Количество колес: {self.num_wheels}, Скорость: {self.speed}")


# Пример использования класса PassengerCar
my_car = PassengerCar("Toyota", "Red") #Создание объекта легковой машины
my_car.display_info() #Вывод информации об автомобиле (унаследованный цвет и марка, и собственное количество колес)
my_car.drive(60) #Изменение скорости автомобиля (унаследованный метод)
print(f"Текущая скорость: {my_car.speed}") #Вывод текущей скорости (измененной унаследованным методом)
my_car.stop() #Остановка автомобиля (унаследованный метод)
print(f"Текущая скорость: {my_car.speed}")
my_car.color = "Blue"
my_car.display_info()
