# 1. Спросить человека маршрут ("как пройти в библиотеку"). 
# Получить ответ в виде строки. 
# Сохранить в переменную. 
# Вывести первое слово ответа на экран



route = input("Как пройти в библиотеку? ")
first_word = route.split()[0]
print("Первое слово ответа:", first_word)
