# 4. Вывести на экран таблицу из 4 строк: три товара и сумма без использования цикла



item1, price1 = "Хлеб", 45
item2, price2 = "Молоко", 60
item3, price3 = "Сыр", 350

total = price1 + price2 + price3

print(item1, price1)
print(item2, price2)
print(item3, price3)
print("Сумма:", total)
