# Так можно "проверить" ложность:
if None:
    print('None истинен')
else:
    print('None в Python расценивается как ложь')

# Проверьте ложность следующих литералов: '', " ", [], {}, [0], 10

if '':
    print("'' истинен")
else:
    print("'' в Python расценивается как ложь")    


if " ":
    print('" " истина')
else:
    print('" " в Питон расценивается как ложь' )    


if []:
    print("[] истинен")
else:
    print("[] в Python расценивается как ложь")


if  {}:
    print(" {} истинен")
else:
    print(" {} в Python расценивается как ложь")   


      
if  [0]:
    print(" [0] истинен")
else:
    print(" [0] в Python расценивается как ложь") 


if  10:
    print(" 10 истинен")
else:
    print(" 10 в Python расценивается как ложь")