# С клавиатуры вводится строка. 
# Сколько в ней символов? 
# 
# Вводится число. Сколько в нем цифр?

#answer = input('введите строку ')
#print('Сколько в ней символов? ', len(answer))

#mynum = input('Введите число ')
#print('Сколько в нем цифр? ', len(mynum))

# При умножении на положительное целое число N строка 
# прибавляется сама к себе N раз, на отрицательное или ноль - 
# возвращает пустую строку. 
# Упражнения: Напишите букву а на экране 1980 раз. 

print('a' * 1980)


# Нарисуйте "ковёр" 10*10 из букв ш, не используя цикл.

print(('Ш' * 10 + '\n') * 10)
#  А теперь, используя цикл. 

counter = 0
while counter < 10:
    print('Ш' * 10)
    counter += 1

# Нарисуйте "шахматный" ковёр из букв о и точек. 

print(('O.' * 10 + '\n' + '.O' * 10 + '\n') * 5)

# А теперь, чтоб размер клетки доски был не в один символ, а 3*3. А теперь, m*n.

words = 'мама                     мыла         \n\n\n    раму'.split()
print(words)
words = ',мама,мыла,,,,,раму,'.split(',')
print(words)

phrase = 'Каждый охотник желает знать, где сидит фазан.'
nachalo = phrase[:6]  # отрезать от начала ДО 6-го символа
konets = phrase[-6:]  # отрезать конец, от 6-го символа с конца
print(nachalo)
print(konets)
'     some text   '.strip()  # со строки можно "стряхнуть лишнее"
print(phrase.upper())
print(phrase.startswith('Каж'))

print('=^.^='.join(words))
print(']['.join(words))
# Вставляет символ или строку между элементами строкового массива